Revit 2026 API
Ceiling.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
Create(Document, IList<CurveLoop>, ElementId, ElementId, Line, Double)
Top
See Also
Reference
Ceiling Class
Autodesk.Revit.DB Namespace